Revit 2026 API

# RevitCommandId Class

---

Represents a command id in Autodesk Revit.

SystemObject Autodesk.Revit.UIRevitCommandId

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevitCommandId : IDisposable
```
```vb
Public Class RevitCommandId
	Implements IDisposable
```
```cpp
public ref class RevitCommandId : IDisposable
```
```fsharp
type RevitCommandId =
    class
        interface IDisposable
    end
```

The RevitCommandId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanHaveBinding | Indicates whether the command can be assigned a binding to an external add-in. |
|  | HasBinding | Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command. |
|  | Id | The command id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The command name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RevitCommandId |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | LookupCommandId | Looks up and retrieves the Revit command id with the given id string. |
|  | LookupPostableCommandId | Looks up and retrieves the Revit command id with the given id string. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Each Revit command is assigned a command id and non-localized name. This class allows you to look up a command by its name, and represents any Revit command in the use of an AddInCommandBinding.

#### Reference

Autodesk.Revit.UI Namespace